InformationRegisters/НастройкиDICOM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиDICOM</Name>
			<Comment>Legacy</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DCMTK_ЗапросыВызываемыйAETitle</Name>
					<Comment>PACS</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DCMTK_STORESCP_АвтоматическийЗапуск</Name>
					<Comment>Автоматический запуск</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DCMTK_STORESCP_ИспользуемыйAETitle</Name>
					<Comment>DICOM Storage AETitle</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DCMTK_STORESCP_КаталогФайлов</Name>
					<Comment>Каталог файлов DICOM Storage</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>STORESCP_ИспользоватьКлиент</Name>
					<Comment>Использовать хранилище на клиенте</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>STORESCP_ОчищатьКаталогЧерез</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MPPSDICOM_КаталогФайлов</Name>
					<Comment>Каталог файлов MPPS</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиDICOM/Forms/ФормаНастроекПользователя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.НастройкиТекущегоПользователя = Истина Тогда
		ПрочитатьНастройкиПользователя(DICOMРаботаСДрайвером.ТекущийПользователь());
		Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Каталог = ДиалогВыбораКаталога.Каталог;
		Если Элемент.Имя = "DCMTK_STORESCP_КаталогФайлов" Тогда
			ЭтаФорма.Запись.DCMTK_STORESCP_КаталогФайлов = Каталог;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиПользователя(Пользователь)
	МЗ = РегистрыСведений.НастройкиDICOM.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = Пользователь;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		ЗначениеВДанныеФормы(МЗ, ЭтаФорма.Запись);
	Иначе
		ЭтаФорма.Запись.Пользователь = Пользователь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
